{
  "backend/main.mo": "Defines user roles including new client role, manages user profiles, access control, and owner/admin enforcement with profile save and retrieval functions.",
  "backend/migration.mo": "Provides migration logic converting old state structures to new ones by adding client role support and initializing new request fields.",
  "feature_evidence.json": "Lists feature evidence entries mapping requested features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files describing routing, hooks, components, and role-based behavior updates including client role support.",
  "frontend/docs/change-request-intake.md": "Template form for documenting requested UI changes with required details, verification steps, and approval before implementation.",
  "frontend/docs/edubridge-roles-requests-and-notifications.md": "Documentation explaining user roles, request submission rules, landing page behavior, account creation, request form logic, and admin review workflows.",
  "frontend/index.css": "Tailwind setup defining CSS variables for light and dark themes and applying global background/text styles.",
  "frontend/index.html": "Base HTML file that loads the React app root and main TypeScript entry module.",
  "frontend/README.md": "Project overview and strict change‑request process requiring documented and confirmed specifications before implementing UI changes.",
  "frontend/src/App.tsx": "Main router configuration defining all routes, protected areas, redirects, and layout/theme providers.",
  "frontend/src/components/admin/AnalyticsCharts.tsx": "Displays admin dashboard stats using cards and icons for users, requests, and ratings.",
  "frontend/src/components/animation/FloatingShapes.tsx": "Renders animated blurred shape backgrounds for decorative visual effects.",
  "frontend/src/components/animation/RevealOnScroll.tsx": "Component that reveals content with a fade/slide animation when it enters the viewport.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with a button to return home when authorization fails.",
  "frontend/src/components/chat/ChatPanel.tsx": "Chat interface for request conversations handling messages, permissions, auto-scroll, and unauthorized states.",
  "frontend/src/components/forms/SafeInput.tsx": "Wrapper around Input that restricts allowed input types for safer form usage.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component handling navigation, theming, and role‑based links with responsive header UI.",
  "frontend/src/components/marketing/TypingHeroText.tsx": "Animated typing hero text that cycles through a full string with type and delete effects.",
  "frontend/src/components/owner/TelegramConfigCard.tsx": "Card UI for viewing and updating Telegram bot configuration using admin hooks and form inputs.",
  "frontend/src/components/ratings/RatingDialog.tsx": "Dialog for submitting a star rating and comment for a helper, posting via useAddRating.",
  "frontend/src/components/requests/RequestsFilters.tsx": "Filter UI for searching requests, toggling offline‑only, and filtering by city.",
  "frontend/src/components/requests/RequestsTable.tsx": "Grid of request cards showing status, location, and optional chat/unread indicators with selection handling.",
  "frontend/src/components/requests/RequestSuccessBanner.tsx": "Success banner card after submitting a request with navigation buttons to dashboard or create another.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an authenticated or anonymous backend actor and refreshing dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Provides admin-only queries and mutations for users, requests, analytics, and deletion actions using the backend actor.",
  "frontend/src/hooks/useAuth.ts": "Handles authentication state via Internet Identity, user profile loading, role helpers, and dashboard navigation.",
  "frontend/src/hooks/useChat.ts": "Implements message fetching, sending, marking as read, and unread count queries for chat tied to a request.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and updates the caller’s user profile via actor methods with react-query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity persistence using AuthClient.",
  "frontend/src/hooks/useRatings.ts": "Supports adding ratings and fetching ratings for the helper or a specific user.",
  "frontend/src/hooks/useRequests.ts": "Supplies CRUD-like hooks for creating, listing, and filtering work requests via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode, utility classes, and custom animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CreateAccountPage.tsx": "Handles account creation flow with login, profile form, and role selection, saving user data and redirecting to the dashboard.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Admin dashboard fetching users, requests, and analytics with delete actions and authorization/error states.",
  "frontend/src/pages/dashboards/HelperDashboardPage.tsx": "Helper dashboard listing available and assigned requests with filters and chat access for selected items.",
  "frontend/src/pages/dashboards/StudentDashboardPage.tsx": "Student dashboard showing categorized request statuses, stats, and message notifications with chat integration.",
  "frontend/src/pages/FreelancingHelpPage.tsx": "Provides a form for students or businesses to submit freelancing help requests and shows a success banner on submission.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing homepage with hero content, features, and navigation actions including role‑based account creation.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen using Internet Identity and redirects authenticated users to their dashboard.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with a message and a button returning users to the homepage.",
  "frontend/src/pages/owner/OwnerConsolePage.tsx": "Owner console displaying business stats, request counts, analytics, and Telegram configuration status.",
  "frontend/src/pages/owner/OwnerInboxPage.tsx": "Displays the owner inbox with filters for request statuses and navigation to detail pages.",
  "frontend/src/pages/owner/OwnerRequestDetailPage.tsx": "Shows detailed information for a specific request and allows owners to approve, reject, or view chat.",
  "frontend/src/pages/StudentRequestHelpPage.tsx": "Lets students or businesses submit online or offline help requests, validating input and showing a success banner after creation.",
  "frontend/src/pages/WorkRequestPage.tsx": "Form page for users to submit work requests with validation, role checks, and request creation via mutation.",
  "frontend/src/routes/ProtectedRoute.tsx": "Wraps routes with authentication, role, and admin checks, rendering redirects or access-denied screens as needed.",
  "frontend/src/seo/usePageTitle.ts": "Hook that updates the document title for each page.",
  "frontend/src/utils/helpRequestErrors.ts": "Maps backend error messages for help requests to user-friendly text.",
  "frontend/src/utils/localProfileExtras.ts": "Stores, retrieves, and clears extra profile metadata in localStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and container settings.",
  "project_state.json": "Contains the project’s current state, requirements, and features for enhancing a web app with new user roles, updated flows, submission options, and admin review workflows. Includes architectural notes, versioning, and a list of existing feature definitions."
}