{
  "backend/main.mo": "Main canister implementing user profiles, access control, single-owner admin logic, and profile CRUD with role syncing.",
  "backend/migration.mo": "Migration module converting old actor state to new structure by adding owner and Telegram config fields.",
  "feature_evidence.json": "Feature evidence report listing implemented features, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files, hooks, components, and pages.",
  "frontend/docs/change-request-intake.md": "Template for submitting and approving detailed UI/feature change requests before implementation.",
  "frontend/index.css": "Tailwind base style configuration defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app and setting site metadata.",
  "frontend/README.md": "Frontend documentation detailing technology stack and strict change request intake process.",
  "frontend/src/App.tsx": "Defines the app’s router structure, including protected routes, redirects, and admin-only sections using TanStack Router.",
  "frontend/src/components/admin/AnalyticsCharts.tsx": "Renders admin analytics cards showing user, request, and rating statistics with icons.",
  "frontend/src/components/animation/FloatingShapes.tsx": "Displays animated floating background shapes for visual decoration.",
  "frontend/src/components/animation/RevealOnScroll.tsx": "Reveals wrapped content with a fade-and-slide animation when it enters the viewport.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access-denied message with a button to return home.",
  "frontend/src/components/chat/ChatPanel.tsx": "Implements a chat interface with message fetching, sending, auto-scrolling, and read receipts for a request.",
  "frontend/src/components/forms/SafeInput.tsx": "Wraps the Input component while restricting allowed input types.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the global layout, including navigation, theme toggle, and role-based links.",
  "frontend/src/components/marketing/TypingHeroText.tsx": "Creates a looping type-and-delete text animation for hero section messaging.",
  "frontend/src/components/owner/TelegramConfigCard.tsx": "Manages Telegram bot configuration for admin notifications, showing status and update form.",
  "frontend/src/components/ratings/RatingDialog.tsx": "Modal for submitting a rating with stars and comment, calling useAddRating and resetting state on success.",
  "frontend/src/components/requests/RequestsFilters.tsx": "Filter panel providing search, offline-only toggle, and optional city filter, emitting changes via callbacks.",
  "frontend/src/components/requests/RequestsTable.tsx": "Displays requests as cards with status, actions, location, and optional chat indicators using unread counts.",
  "frontend/src/components/requests/RequestSuccessBanner.tsx": "Success card showing confirmation of a submitted request with buttons to navigate to dashboard or submit another.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Admin-only hooks for checking admin status and managing users, requests, and analytics via actor calls.",
  "frontend/src/hooks/useAuth.ts": "Authentication helper exposing login, logout, profile state, role checks, and dashboard navigation.",
  "frontend/src/hooks/useChat.ts": "Chat hooks for fetching, sending, and marking messages as read, plus unread count polling.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for retrieving and saving the authenticated user's profile via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking. Includes utilities to create an AuthClient with configurable options.",
  "frontend/src/hooks/useRatings.ts": "Defines React Query hooks to add ratings and fetch ratings for helpers or specific users using the backend actor. Invalidates related rating queries on mutations.",
  "frontend/src/hooks/useRequests.ts": "Implements React Query hooks for creating, fetching, filtering, accepting, and completing help requests via the backend actor. Automatically invalidates relevant request queries after mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with theme variables, dark mode styles, utility classes, gradients, glass effects, and animations. Applies global styling for consistent UI appearance.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers before rendering App. Imports global styling.",
  "frontend/src/pages/CreateAccountPage.tsx": "Handles the two-step account creation flow with Internet Identity login and profile setup. Saves profile data, stores extra fields locally, and redirects users to their dashboard.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Admin dashboard showing users, requests, analytics, and tools for deleting users or requests, with authorization and error handling.",
  "frontend/src/pages/dashboards/HelperDashboardPage.tsx": "Displays helper dashboard with filters, available/assigned requests, and actions to accept, complete, and chat about requests.",
  "frontend/src/pages/dashboards/StudentDashboardPage.tsx": "Shows student dashboard with categorized requests, search filtering, chat access, and rating dialog for completed tasks.",
  "frontend/src/pages/FreelancingHelpPage.tsx": "Allows eligible authenticated users to submit freelancing help requests, validating profile status and permissions. Submits requests via backend and displays a success banner after submission.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, feature highlights, stats, and navigation buttons for account creation, login, and help requests.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity with authentication handling, loading states, and redirect for authenticated users.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page displaying an error message and a button to return home.",
  "frontend/src/pages/owner/OwnerConsolePage.tsx": "Owner admin console providing business stats, request counts, and Telegram config status with navigation shortcuts.",
  "frontend/src/pages/owner/OwnerInboxPage.tsx": "Lists all requests for owners with filtering by status and navigation to view request details.",
  "frontend/src/pages/owner/OwnerRequestDetailPage.tsx": "Displays full details of a specific request for owners, including status, metadata, and integrated chat panel.",
  "frontend/src/pages/StudentRequestHelpPage.tsx": "Form page for students or businesses to submit help requests with validation, authentication checks, and success banner.",
  "frontend/src/pages/WorkRequestPage.tsx": "Form page allowing eligible users to submit work requests with role-based permissions, validation, and success feedback.",
  "frontend/src/routes/ProtectedRoute.tsx": "Guards routes based on authentication, role requirements, and optional admin backend verification.",
  "frontend/src/seo/usePageTitle.ts": "Sets the document title for each page using a React effect.",
  "frontend/src/utils/helpRequestErrors.ts": "Converts backend help-request error messages into user-friendly text descriptions.",
  "frontend/src/utils/localProfileExtras.ts": "Stores, retrieves, and clears per-user profile extras in localStorage using a prefixed key.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters, persist them in sessionStorage, and manage hash-based params including removal.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theming, colors, fonts, animations, and plugin integration for the frontend.",
  "project_state.json": "Stores the project’s architectural notes, issues, features, and metadata describing current app state and requirements."
}