{
  "backend/main.mo": "Motoko canister defining user profiles, authorization checks, and request data structures with create/retrieve functions.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Text file containing short summaries of many frontend source files.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions for light/dark themes.",
  "frontend/index.html": "Base HTML entry point loading the React app root and main script.",
  "frontend/README.md": "Frontend README with basic project and development instructions.",
  "frontend/src/App.tsx": "Root React router setup with layout, theme provider, and all page routes including protected ones.",
  "frontend/src/components/admin/AnalyticsCharts.tsx": "Displays admin analytics stats using cards with icons and values.",
  "frontend/src/components/animation/FloatingShapes.tsx": "Renders animated floating background shapes for visual effects.",
  "frontend/src/components/animation/RevealOnScroll.tsx": "IntersectionObserver-based wrapper that fades content in on scroll.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Access denied UI with explanation and button to return home.",
  "frontend/src/components/chat/ChatPanel.tsx": "Chat interface for request conversations with message list, send box, and read status handling.",
  "frontend/src/components/forms/SafeInput.tsx": "Input wrapper restricting allowed input types to safe text-like fields.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component providing navigation, theming toggle, and role-based links around page content.",
  "frontend/src/components/marketing/TypingHeroText.tsx": "Animated typing text component cycling through a marketing tagline.",
  "frontend/src/components/ratings/RatingDialog.tsx": "Dialog for submitting a star rating and comment for a helper, using a rating mutation.",
  "frontend/src/components/requests/RequestsFilters.tsx": "Filter panel for searching and narrowing requests by text, offline-only toggle, and city.",
  "frontend/src/components/requests/RequestsTable.tsx": "Grid of request cards showing status, location, chat info, and optional action buttons.",
  "frontend/src/components/requests/RequestSuccessBanner.tsx": "Success banner showing confirmation after submitting a request with actions to navigate or submit another.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an authenticated or anonymous backend actor and invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Admin-focused hooks for fetching users, requests, analytics, and performing delete operations via the actor.",
  "frontend/src/hooks/useAuth.ts": "Authentication hook that exposes identity, profile, role helpers, login/logout, and dashboard navigation.",
  "frontend/src/hooks/useChat.ts": "Provides React Query hooks for fetching, sending, and marking chat messages as read, plus querying unread counts.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Contains hooks for loading and saving the caller's user profile via the actor API with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling authentication, identity loading, and login state.",
  "frontend/src/hooks/useRatings.ts": "Offers hooks to add ratings and fetch ratings for the current helper or a specific user.",
  "frontend/src/hooks/useRequests.ts": "Provides hooks for creating, fetching, updating, and filtering task requests through the actor API.",
  "frontend/src/index.css": "Defines Tailwind layers and custom theme variables for light/dark mode, gradients, glass effects, and animations.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CreateAccountPage.tsx": "Implements the account creation flow with login, profile form handling, profile saving, and navigation.",
  "frontend/src/pages/dashboards/AdminDashboardPage.tsx": "Admin dashboard for viewing analytics and managing users and requests, including deletion actions.",
  "frontend/src/pages/dashboards/HelperDashboardPage.tsx": "Displays helper dashboard with filters, available/assigned requests, accept/complete actions, and chat panel integration.",
  "frontend/src/pages/dashboards/StudentDashboardPage.tsx": "Shows student dashboard with request filtering, status grouping, chat access, and rating dialog for completed tasks.",
  "frontend/src/pages/FreelancingHelpPage.tsx": "Provides a form for users to submit freelancing help requests and shows a success banner after submission.",
  "frontend/src/pages/LandingPage.tsx": "Renders the platform landing page with hero content, feature highlights, stats, and navigation actions.",
  "frontend/src/pages/LoginPage.tsx": "Handles user login via Internet Identity and redirects authenticated users to their dashboards.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 message with an option to return to the home page.",
  "frontend/src/pages/StudentRequestHelpPage.tsx": "Allows students to submit help requests, including optional offline location details, and shows a success banner afterward.",
  "frontend/src/routes/ProtectedRoute.tsx": "Guards routes by checking authentication, profile readiness, and optional role requirements.",
  "frontend/src/seo/usePageTitle.ts": "Hook that sets the document title with an EduBridge suffix.",
  "frontend/src/utils/localProfileExtras.ts": "Utilities to store, retrieve, and clear extra profile fields in localStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from URL/hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings for the app's theme.",
  "project_state.json": "Project state metadata describing the app’s purpose, architecture, features, and current version."
}