{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "EduBridge: Client role, entry selection, upgraded request form (online/offline), admin review visibility, and accept/reject user notifications (preserve design)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Support a new \"Client\" user role across frontend auth, navigation, and role-based routing without type errors.",
      "acceptanceCriteria": [
        "Frontend role selection supports client without TypeScript/type errors.",
        "Client users can authenticate and navigate to the correct post-login destination (dashboard or request submission flow) without being treated as helper/freelancer."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.ts",
          "operation": "modify",
          "description": "Update role-based navigation to recognize UserRole.client and route client users to the correct post-login destination (e.g., request submission flow) while preserving existing student/business/helper/admin behavior. Use the authorization component patterns for authenticated/profile-ready gating (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Update role-aware nav links so Client users see the appropriate navigation items (and are not treated as Helper/Freelancer). Keep existing glass/gradient styling and responsive header behavior unchanged."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Ensure post-login redirects handle UserRole.client consistently (via existing useAuth navigation helpers). Use the authorization component’s guidance for login/logout and cached data clearing (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/routes/ProtectedRoute.tsx",
          "operation": "modify",
          "description": "Extend role-based protection logic to treat Client as a first-class non-admin role where applicable, while keeping existing access rules intact. Use the authorization component’s access-control UI guidance (AccessDeniedScreen) as appropriate (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a landing-page entry selection section with exactly three prominent options: Student, Client, Business, using existing transition/animation styling.",
      "acceptanceCriteria": [
        "Landing page shows three selectable options: Student, Client, Business.",
        "Each option uses a noticeable, tasteful transition/animated text treatment that matches the existing visual language (glass/gradient/animations already used on the site).",
        "Selecting an option routes the user into the appropriate next step (account creation and/or request submission), without breaking existing Create Account / Login buttons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Insert an entry selection section (Student/Client/Business only) into the existing landing layout, reusing current glass/gradient/animation patterns. Wire each option to route into Create Account with the selected role prefilled (e.g., via query/session params) without removing or breaking existing Create Account / Login / Request Help buttons."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Add/extend small utilities to persist and read an intended entry role selection across navigation (e.g., landing -> create-account) using existing sessionStorage patterns, without changing the overall routing structure."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add minimal, theme-consistent utility classes (if needed) for the entry selection typography/transition effect, reusing the app’s existing animation/glass conventions and avoiding any theme redesign."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update Create Account flow to include Client role and keep all role labels consistent in English.",
      "acceptanceCriteria": [
        "Create Account role picker includes Client as a selectable role.",
        "Existing roles (Student, Business, and existing Freelancer/Helper) continue to work as before.",
        "After profile creation, users are redirected based on their selected role without loops or access denied errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CreateAccountPage.tsx",
          "operation": "modify",
          "description": "Add Client to the role picker and role union types; keep English labels consistent (Student, Client, Business, and Freelancer/Helper if still supported). Prefill the selected role when arriving from landing entry selection. Use the authorization component’s profile setup guidance to avoid modal/flow flashes and to keep auth gating consistent (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/hooks/useAuth.ts",
          "operation": "modify",
          "description": "Ensure navigateToDashboard handles Client consistently after profile creation and on subsequent logins (e.g., route client users to /work-request if no dedicated dashboard exists). Use the authorization component’s login/profile conventions (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Upgrade /work-request form to capture Name, Age, Title, Description for Student/Client/Business with role-specific helper text, and restrict submission permissions accordingly.",
      "acceptanceCriteria": [
        "Work request form includes fields for Name and Age in addition to Title and Description for Student, Client, and Business submitters.",
        "Role-specific labels/help text are shown (e.g., Student: \"Title of work (assignment/homework)\"; Client: \"Title of work requested (freelancing task)\"; Business: \"Title of service/product\").",
        "Only Student, Client, and Business roles can submit requests via this page; helper/freelancer role is not allowed to create requests unless explicitly retained by existing product logic."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WorkRequestPage.tsx",
          "operation": "modify",
          "description": "Add Name and Age inputs and role-specific helper text for Title/Description based on the authenticated user role (Student/Client/Business). Update role gating so helpers/freelancers cannot submit requests from this page. Preserve existing glass/gradient/animation UI patterns and validation/toast behavior."
        },
        {
          "path": "frontend/src/hooks/useRequests.ts",
          "operation": "modify",
          "description": "Update the request creation call to include the newly captured fields in the submitted payload format used by the app (and keep React Query invalidations intact). Align with the current backend type surface in frontend/src/backend.d.ts so there are no TS errors."
        },
        {
          "path": "frontend/src/utils/helpRequestErrors.ts",
          "operation": "modify",
          "description": "Extend error-to-message mapping (if needed) for new validation and role permission cases so user-facing messages remain clear and in English."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add Online/Offline mode to the request form and show the exact Moon Bake offline meeting notice; ensure offline requests are marked and location info is included in the submitted data.",
      "acceptanceCriteria": [
        "Request form provides a clear Online/Offline selection control.",
        "When Offline is selected, the UI displays the required meeting notice text verbatim in English.",
        "Online submissions do not show the meeting notice and are stored as online (not offline)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/WorkRequestPage.tsx",
          "operation": "modify",
          "description": "Replace/upgrade the existing offline checkbox into an explicit Online/Offline selection. When Offline is selected, display the notice exactly as: \"Meet at Moon Bake, Kengeri Satellite Town, Bangalore 560060.\" Ensure the UI uses existing glass/gradient/animation patterns and remains responsive."
        },
        {
          "path": "frontend/src/hooks/useRequests.ts",
          "operation": "modify",
          "description": "Ensure the request creation call submits SubmissionMode online/offline consistently and includes the fixed offline location details when Offline is chosen, while keeping existing cache invalidations and request list updates working."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Ensure the owner/admin inbox and detail views display the new/updated request fields and that accept/reject and chat initiation remain functional.",
      "acceptanceCriteria": [
        "New/updated request fields (Name, Age, submission mode/location) are visible to the owner in Owner Inbox and Owner Request Detail views.",
        "Owner can accept or reject pending requests as before.",
        "Owner/admin can initiate chat messages to the request owner using the existing chat functionality (no permission errors)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/owner/OwnerInboxPage.tsx",
          "operation": "modify",
          "description": "Update request cards to display the added fields (Name, Age) and clearly indicate submission mode (Online/Offline) and offline meeting location info when present, without changing the existing page structure or theme."
        },
        {
          "path": "frontend/src/pages/owner/OwnerRequestDetailPage.tsx",
          "operation": "modify",
          "description": "Update the detail view to show Name, Age, and submission mode/location alongside existing request information. Keep accept/reject actions and ChatPanel integration unchanged aside from needed field visibility updates."
        },
        {
          "path": "frontend/src/components/requests/RequestsTable.tsx",
          "operation": "modify",
          "description": "Where requests are shown in dashboards via RequestsTable, add compact display of submission mode (and offline meeting location when applicable) while preserving existing card layout and unread-chat badge behavior."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add automatic in-app acceptance/rejection notifications to the submitting user (as system chat message and/or dashboard status banner).",
      "acceptanceCriteria": [
        "On admin acceptance, the submitting user can see an explicit confirmation message associated with that request (not only a status change).",
        "On admin rejection, the submitting user can see an explicit rejection message that encourages them to try again.",
        "Messages are generated automatically at the time of accept/reject and do not require the owner to manually type them."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/owner/OwnerRequestDetailPage.tsx",
          "operation": "modify",
          "description": "After a successful Accept/Reject action, automatically trigger a chat send for that request with the exact English copy defined in the spec (system/auto message), so the user receives an explicit confirmation/rejection message without owner typing."
        },
        {
          "path": "frontend/src/hooks/useChat.ts",
          "operation": "modify",
          "description": "Add a small helper/mutation wrapper (if needed) to support sending standardized system messages after moderation actions while preserving existing query invalidation and unread-count refresh behavior."
        },
        {
          "path": "frontend/src/pages/dashboards/StudentDashboardPage.tsx",
          "operation": "modify",
          "description": "Add an in-dashboard notification surface (e.g., a status banner per request or when a request is selected) that surfaces acceptance/rejection messages and/or status in English, consistent with existing dashboard UI styling."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Preserve existing look-and-feel; new UI must reuse existing glass/gradient/animation patterns and remain responsive with no regressions.",
      "acceptanceCriteria": [
        "New UI components visually match current styling (cards/buttons/gradients/glass effects).",
        "All upgraded flows are responsive and usable on mobile and desktop.",
        "No regressions to existing pages (Landing, Login, Create Account, Owner Inbox/Detail, dashboards) in layout or theme variables."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If any additional styling is required for the new entry selection and form controls, implement it via minimal additions that reuse existing theme variables and animation conventions; avoid introducing a new theme."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Ensure the new entry selection section uses existing components and styling patterns (glass/gradients/animations) and behaves well on mobile/desktop without restructuring the overall page."
        },
        {
          "path": "frontend/src/pages/WorkRequestPage.tsx",
          "operation": "modify",
          "description": "Ensure new fields and online/offline controls reuse existing Card/Input/Button styling conventions and remain responsive; do not introduce new UI primitives under frontend/src/components/ui."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add an in-repo implementation guide documenting roles, entry selection flow, form fields, offline behavior, and accept/reject notification copy.",
      "acceptanceCriteria": [
        "A written spec exists in the frontend/docs or root docs describing the upgraded flows and data fields.",
        "The spec includes the exact English copy for the Offline meeting notice and accept/reject messages.",
        "The spec matches the implemented behavior (no mismatches between doc and app)."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/edubridge-roles-requests-and-notifications.md",
          "operation": "create",
          "description": "Create a comprehensive spec describing: roles (Student/Client/Business/Helper/Admin), landing entry-selection flow, Create Account role picker labels, all request form fields (Name/Age/Title/Description), Online/Offline behavior including the exact offline notice text \"Meet at Moon Bake, Kengeri Satellite Town, Bangalore 560060.\", and the exact auto-generated accept/reject message copy shown to users."
        },
        {
          "path": "frontend/README.md",
          "operation": "modify",
          "description": "Add a link/reference to the new frontend/docs/edubridge-roles-requests-and-notifications.md so the implementation guide is easy to find and stays aligned with the required change-request process."
        }
      ]
    }
  ]
}